# Copyright (c) 2013, Pullenti. All rights reserved. Non-Commercial Freeware.
# This class is generated using the convertor N2JP from Pullenti C#.NET project.
# See www.pullenti.ru/downloadpage.aspx.
# 
# 

from enum import IntEnum


class OrganizationKind(IntEnum):
    """ Разновидности организаций """
    UNDEFINED = 0
    """ Неопределённая """
    GOVENMENT = 0 + 1
    PARTY = (0 + 1) + 1
    STUDY = ((0 + 1) + 1) + 1
    SCIENCE = (((0 + 1) + 1) + 1) + 1
    """ Научно-исследовательские """
    PRESS = ((((0 + 1) + 1) + 1) + 1) + 1
    MEDIA = (((((0 + 1) + 1) + 1) + 1) + 1) + 1
    FACTORY = ((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1
    BANK = (((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    CULTURE = ((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    MEDICAL = (((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    TRADE = ((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    HOLDING = (((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    DEPARTMENT = ((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Подразделение """
    FEDERATION = (((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Федерация, Союз и т.п. непонятность """
    HOTEL = ((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Отели, Санатории, Пансионаты ... """
    JUSTICE = (((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Суды, тюрьмы ... """
    CHURCH = ((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Церкви, религиозное """
    MILITARY = (((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Военные """
    AIRPORT = ((((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Аэропорт """
    FESTIVAL = (((((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ События (фестиваль, чемпионат) """