# Copyright (c) 2013, Pullenti. All rights reserved. Non-Commercial Freeware.
# This class is generated using the convertor N2JP from Pullenti C#.NET project.
# See www.pullenti.ru/downloadpage.aspx.
# 
# 

from enum import IntEnum


class OrgProfile(IntEnum):
    """ Профили организации, хранятся в атрибутах ATTR_PROFILE, может быть несколько. """
    UNDEFINED = 0
    """ Неопределённое """
    UNIT = 0 + 1
    """ Подразделение, отдел """
    UNION = (0 + 1) + 1
    """ Различные объединения людей (фонды, движения, партии, ассоциации) """
    COMPETITION = ((0 + 1) + 1) + 1
    """ Соревнование, конкурс, чемпионат """
    HOLDING = (((0 + 1) + 1) + 1) + 1
    """ Группы компаний, холдинги """
    STATE = ((((0 + 1) + 1) + 1) + 1) + 1
    """ Государственные """
    BUSINESS = (((((0 + 1) + 1) + 1) + 1) + 1) + 1
    """ Бизнес, коммерция """
    FINANCE = ((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Финансы (банки, фонды) """
    EDUCATION = (((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Образование """
    SCIENCE = ((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Наука """
    INDUSTRY = (((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Производство """
    TRADE = ((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Торговля, реализация """
    MEDICINE = (((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Медицина """
    POLICY = ((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Политика """
    JUSTICE = (((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Судебная система """
    ENFORCEMENT = ((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Силовые структуры """
    ARMY = (((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Армейские структуры """
    SPORT = ((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Спорт """
    RELIGION = (((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Религиозные """
    ART = ((((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Искусство """
    MUSIC = (((((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Музыка, группы """
    SHOW = ((((((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Театры, выставки, музеи, концерты """
    MEDIA = (((((((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Срадства массовой информации """
    PRESS = ((((((((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Издательства, газеты, журналы ... (обычно вместе с Media) """
    HOTEL = (((((((((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ пансионаты, отели, дома отдыха """
    FOOD = ((((((((((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Предприятия питания """
    TRANSPORT = (((((((((((((((((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Железные дороги, авиакомпании ... """