# Copyright (c) 2013, Pullenti. All rights reserved. Non-Commercial Freeware.
# This class is generated using the convertor N2JP from Pullenti C#.NET project.
# See www.pullenti.ru/downloadpage.aspx.
# 
# 

from enum import IntEnum


class ChatType(IntEnum):
    """ Типы диалоговых элементов """
    UNDEFINED = 0
    """ Неопределённый """
    THANKS = 0 + 1
    """ Благодарность """
    MISC = (0 + 1) + 1
    """ Вводные слова, мусор и пр., на что не стоит обращать внимание """
    HELLO = ((0 + 1) + 1) + 1
    """ Привет """
    BYE = (((0 + 1) + 1) + 1) + 1
    """ Пока """
    ACCEPT = ((((0 + 1) + 1) + 1) + 1) + 1
    """ Согласие """
    CANCEL = (((((0 + 1) + 1) + 1) + 1) + 1) + 1
    """ Отказ """
    BUSY = ((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Занят """
    VERB = (((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Глагольная группа """
    LATER = ((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Позже - (например, перезвонить позже) """
    DATE = (((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ дата (возможно, относительная) """
    REPEAT = ((((((((((0 + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1) + 1
    """ Просьба повторить """